#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/achterkamp/gh-actions-gcp/runs/run-6N9Trw5RExQ8VBfV

Waiting for the plan to start...

Terraform v0.15.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_backend_bucket.website will be created
  + resource "google_compute_backend_bucket" "website" {
      + bucket_name        = "p-57068-cdn-web-2"
      + creation_timestamp = (known after apply)
      + description        = "Contains files needed by the website"
      + enable_cdn         = true
      + id                 = (known after apply)
      + name               = "website-backend"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)
        }
    }

  # google_compute_global_address.website will be created
  + resource "google_compute_global_address" "website" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "website-lb-ip"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_global_address.website_1 will be created
  + resource "google_compute_global_address" "website_1" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "website-lb-ip-1"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_global_forwarding_rule.default will be created
  + resource "google_compute_global_forwarding_rule" "default" {
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "TCP"
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "website-forwarding-rule"
      + port_range            = "443"
      + project               = (known after apply)
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_managed_ssl_certificate.website will be created
  + resource "google_compute_managed_ssl_certificate" "website" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "website-cert"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "github.devops100.tk.",
            ]
        }
    }

  # google_compute_target_https_proxy.website will be created
  + resource "google_compute_target_https_proxy" "website" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "website-target-proxy"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_url_map.website will be created
  + resource "google_compute_url_map" "website" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "website-url-map"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_dns_record_set.website will be created
  + resource "google_dns_record_set" "website" {
      + id           = (known after apply)
      + managed_zone = "devops100-tk-zone"
      + name         = "github.devops100.tk."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.website_1 will be created
  + resource "google_dns_record_set" "website_1" {
      + id           = (known after apply)
      + managed_zone = "devops100-tk-zone"
      + name         = "www.devops100.tk."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_storage_bucket.website will be created
  + resource "google_storage_bucket" "website" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "p-57068-cdn-web-2"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket_object.hello will be created
  + resource "google_storage_bucket_object" "hello" {
      + bucket         = "p-57068-cdn-web-2"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "hello.html"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "hello.html"
      + storage_class  = (known after apply)
    }

  # google_storage_default_object_access_control.website_read will be created
  + resource "google_storage_default_object_access_control" "website_read" {
      + bucket       = "p-57068-cdn-web-2"
      + domain       = (known after apply)
      + email        = (known after apply)
      + entity       = "allUsers"
      + entity_id    = (known after apply)
      + generation   = (known after apply)
      + id           = (known after apply)
      + project_team = (known after apply)
      + role         = "READER"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + https_domain     = [
      + {
          + domains = [
              + "github.devops100.tk.",
            ]
        },
    ]
  + load_balancer_ip = (known after apply)
```

</details>

*Pusher: @albert-achterkamp, Action: `pull_request`*